/******************************************************************************/
/** 模块名称：不带操作系统LwIP以太网通讯                                     **/
/** 文件名称：telnetprocess.h                                                **/
/** 版    本：V1.0.0                                                         **/
/** 简    介：用于实现基于LwIP的Telnet服务器功能                             **/
/**--------------------------------------------------------------------------**/
/** 修改记录：                                                               **/
/**     版本      日期              作者              说明                   **/
/**     V1.0.0  2018-08-01          木南              创建文件               **/
/**                                                                          **/
/******************************************************************************/ 

#ifndef __TELNET_PROCESS_H
#define __TELNET_PROCESS_H


/* TELNET服务器初始化配置*/
void Telnet_Server_Initialization(void);

#endif

/*********** (C) COPYRIGHT 1999-2018 Moonan Technology *********END OF FILE****/