/******************************************************************************/
/** 文件名   mbascii.h                                                    **/
/** 作  者   尹家军                                                          **/
/** 版  本   V1.0.0                                                          **/
/** 日  期   2018年9月13日                                                   **/
/** 简  介   用于实现Modbus ASCII总线协议栈ADU的封装                          **/
/******************************************************************************/

#ifndef __mbascii_h
#define __mbascii_h




#endif
/*********** (C) COPYRIGHT 1999-2018 Moonan Technology *********END OF FILE****/