/******************************************************************************/
/** 模块名称：Modbus通讯                                                     **/
/** 文件名称：mbtcp.h                                                        **/
/** 版    本：V1.0.0                                                         **/
/** 简    介：用于实现Modbus TCP总线协议站ADU的封装                          **/
/**           1、实现作为客户端时访问服务器数据命令的生成                    **/
/**           2、实现作为服务器端时，对客户端命令的响应信息的生成            **/
/**                                                                          **/
/* MBAP报文头的包括的内容：                                                   */
/* +-------------+---------+--------+--------+------------------------------+ */
/* |     域      |  长度   | 客户机 | 服务器 |              描述            | */
/* +-------------+---------+--------+--------+------------------------------+ */
/* |事务元标识符 | 2个字节 |  启动  |  复制  |请求/响应事务处理的识别码     | */
/* +-------------+---------+--------+--------+------------------------------+ */
/* |协议标识符   | 2个字节 |  启动  |  复制  |0=MODBUS 协议                 | */
/* +-------------+---------+--------+--------+------------------------------+ */
/* |    长度     | 2个字节 |  启动  |  启动  |以下字节的数量                | */
/* +-------------+---------+--------+--------+------------------------------+ */
/* |单元标识符   | 1个字节 |  启动  |  复制  |连接的远程从站的识别码        | */
/* +-------------+---------+--------+---------------------------------------+ */
/**--------------------------------------------------------------------------**/
/** 修改记录：                                                               **/
/**     版本      日期              作者              说明                   **/
/**     V1.0.0  2016-04-17          木南              创建文件               **/
/**                                                                          **/
/******************************************************************************/ 


#ifndef __mbtcp_h
#define __mbtcp_h

#include "mbpdu.h"

//生成读写服务器对象的命令
uint16_t SyntheticReadWriteTCPServerCommand(ObjAccessInfo objInfo,bool *statusList,uint16_t *registerList,uint8_t *commandBytes);

/*合成对服务器访问的响应*/
uint16_t SyntheticServerAccessRespond(uint8_t *receivedMesasage,bool *statusList,uint16_t *registerList,uint8_t *respondBytes);

#endif
/*********** (C) COPYRIGHT 1999-2016 Moonan Technology *********END OF FILE****/